#include<stdio.h>


//int check_sky()
//{
//	int a=1;
//	char* p=(char*)&a;
//	//返回1小端
//	//返回0大端
//	return *p;
//}

//int check_sky()
//{
//	int a=1;
//	
//	//返回1小端
//	//返回0大端
//	return *(char*)&a;;
//}
//
//int main()
//{
//	
//	int ret=check_sky();
//	if(ret==1)
//	{
//		printf("小端\n");
//
//	}else
//	{
//		printf("大端\n");
//	}
//
//	return 0;
//}




//int main()
//{
//	char a=-1;
//	//10000000 00000000 00000000 00000001原码
//	//11111111 11111111 11111111 11111111补码
//
//	//11111111
//	//11111111 11111111 11111111 11111111整型提升
//	signed char b=-1;
//	//11111111
//	//11111111 11111111 11111111 11111111整型提升
//	unsigned char c=-1;
//	//11111111
//	//01111111
//	//00000000 00000000 00000000 01111111无符号数原反补相同
//	printf("a=%d,b=%d,c=%d",a,b,c);
//	return 0;
//}


//int main()
//{
//	char a=-128;
//	//10000000 00000000 00000000 10000000
//	//11111111 11111111 11111111 10000000补码
//	//10000000
//	//11111111 11111111 11111111 10000000补码 无符号数原反补相同
//	printf("%u\n",a);
//	//%u-打印十进制无符号数
//	//%d-打印十进制有符号数
//	return 0;
//}


//-128	<	有符号的char的范围	<	127
//0	<	无符号的char的范围	<	255



#include<windows.h>

//int main()
//{
//	unsigned int i;//定义为无符号数，放进来都是无符号数了，所以死循环
//	for(i=9;i>=0;i--)
//	{
//		printf("%u\n",i);
//		Sleep(100);
//	}
//
//	return 0;
//}


//int main()
//{
//	char a[1000];
//	int i;
//	for(i=0;i<1000;i++)
//	{	//-128	<	有符号的char的范围	<	127
//		//
//		a[i]=-1-i;
//		//-1 - -128,127 - 0
//	}
//	printf("%d",strlen(a));
//	//strlen到“\0”停止，“\0”alls码值为0
//	//-1 - -128=128,127 - 1=127,128+127=255
//	return 0;
//}


//int main()
//{
//	//9.0
//	//1001.0
//	//(-1)^0 * 1.001 * 2^3
//	//(-1)^s * M     * 2^E
//	//s-0
//	//M-1.001
//	//E-3
//	int n=9;
//	float* pFloat=(float*)&n;
//	printf("n=%d\n",n);
//	printf("*pFloat=%f\n",*pFloat);
//
//	*pFloat=9.0;
//	printf("n=%d\n",n);
//	printf("*pFloat=%f\n",*pFloat);
//
//	return 0;
//}


//int main()
//{
//	float f=5.5;
//	//5.5
//	//101.1
//	//(-1)^0 * 1.011 * 2^2
//	
//	//s=0
//	//M=1.011
//	//E=2
//
//	//0 10000001 01100000000000000000000
//	//0100 0000 1011 0000 0000 0000 0000 0000
//	//0x40b00000
//	
//	return 0;
//}


int main()
{
	
	int n=9;
	//00000000 00000000 00000000 00001001 补码
	float* pFloat=(float*)&n;
	printf("n=%d\n",n);
	printf("*pFloat=%f\n",*pFloat);
	//(-1)^0 * 0.00000000000000000001001 *2^-126

	*pFloat=9.0;
	//9.0
	//1001.0
	//(-1)^0 * 1.001 * 2^3
	//(-1)^s * M     * 2^E
	//s-0
	//M-1.001
	//E-3
	//0 1000 0010 00100000000000000000000
	printf("n=%d\n",n);
	//01000001000100000000000000000000
	//1091567616
	printf("*pFloat=%f\n",*pFloat);
	
	return 0;
}
